#include <iostream>

using namespace std;

int main()
{
 int intgers =1,c;
 cout<<"The Prime Numbers between 1 and 10000 are"<<endl;
 while (intgers<=10000)   // سويت وايل لوب عشان تكون بين الواحد وعشره الالف
 {
  c=0;                                                             //ذا عشان اوقف الفور لوب 
  for (int i=2; i<=intgers/2;++i){    // هنا وظيفه الفور لوب انه يتأكد ان الرقم اكبر من 2 واقسمه على اثنين عشان لا صار الباقي من القسمه 0 يكون عدد غير اولي
    if (intgers%i==0){    // زي م قلت فوق مثلا لو دخلتي 4 وانقسمت على 2 بتصير 2 والباقي القسمه من 2 يساوي 0 ف تحقق الشرط وطلع غير اولي
        c=1;                // وهنا غيرت قيمه السي عشان اقدر امنع الفور لوب من انها تستمر
        break;               // هنا عشان اوقف اللوب
    }
  }
  if(c==0)          // طبعا هنا اذا م تحقق شرط الي هو يساوي الصفر ينزل لك على هالشرط  واذا تحقق بيطبع لك
  cout<<intgers<<" "; 
 ++intgers; // هنا عاد اظن تعرفيها بس حبيت اوضح ذي عشان تطبع لك الرقم بعدين يزيد واحد عشان يتكرر الوايل لوب
}
    return 0;
}